Ejemplo App/app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY created_at ASC
---
  def index
    @reviews = Review.all

INSERT INTO "reviews" ("created_at", "description", "product_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save